$ определить предикат mrg(L1, L2, R) который для двух отсортированных списков L1 и L2 
% определяет список R, составленный из этих элементов

mrg([],[],R).

mrg([],R,R).
mrg(L,[],L).

mrg([H1|T1],[H2|T2],[H1|R]):- H1 =< H2, mrg(T1,[H2|T2],R).
mrg([H1|T1],[H2|T2],[H2|R]):- H1 > H2, mrg([H1|T1],T2,R).

% ?- mrg([1,3,5,7,9],[2,4,6,8],K).
% K = [1, 2, 3, 4, 5, 6, 7, 8, 9] .

% ?- mrg([1,2,5,8,10],[2,2,3,4,5,9],K), write(K).
% [1,2,2,2,3,4,5,5,8,9,10]
% K = [1, 2, 2, 2, 3, 4, 5, 5, 8|...] .

% ?- mrg([-6,-4,-2,1,2],[-5,-3,-1,3],K).
% K = [-6, -5, -4, -3, -2, -1, 1, 2, 3] .