% определить предикат mrg(L1, L2, R) который для двух отсортированных списков L1 и L2
% определяет список R, составленный из этих элементов

% Все возможные случаи неполных списков.
merge([], L2, L2) :- !.
merge(L1, [], L1) :- !.
merge([], [], []) :- !.

% Когда оба списка полные.
merge([Hx|Tx], [Hy|Ty], R) :- Hx =< Hy,
                              merge(Tx, [Hy|Ty], M),
                              !,
                              R = [Hx|M];

                              Hx >= Hy,
                              merge(Ty, [Hx|Tx], M),
                              !,
                              R = [Hy|M].

/*
    ?- merge([], [], R).
    R = [].

    ?- merge([0, 1, 4, 11], [], R).
    R = [0, 1, 4, 11].

    ?- merge([], [0, 2, 4], R).
    R = [0, 2, 4].

    ?- merge([0, 1, 4, 11], [5, 6, 7, 8], R).
    R = [0, 1, 4, 5, 6, 7, 8, 11].

    ?- merge([1, 1, 5, 11], [5, 6, 7, 8], R).
    R = [1, 1, 5, 5, 6, 7, 8, 11].
*/

